BoundaryTests/0Tests/stillTotalPressureSteady/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [m^2 s^-2];

internalField   uniform 0;

boundaryField
{
    /* inlet
    {
        type            fanPressure;
        direction       in;
        fanCurve
        {
            type table;
            values
            (
                (0    0)
                (5.75 0)
                (7.5  0)
            );
        }
        p0              uniform 0;
    } */

    inlet
    {
        type            totalPressure;
        p0              uniform 0;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    walls
    {
        type            totalPressure;
        p0              uniform 0;
    }
}


// ************************************************************************* //
